#include <stdio.h>  

int main() {                    
    int iscore = 90.5;
    printf("score: %d\n", iscore);  
    
    float fscore = 90.5;
    printf("score: %.1f\n", fscore);
    
    return 0;                       
}
// ผลลัพธ์ที่ได้ต่างกันโดยที่ int iscore = 90.5 จะแสดงผลเป็น 90 ส่งน float fscore = 90.5 จะแสดงผลเป็น 90.5
// ดังนั้นจึงควรเลือกใช้ Data Type ให้ถูกต้องตามข้อมูลที่เราต้องการจะจัดเก็บเพราะถ้าเลือกผิดจะทำให้ค่าที่เราต้องการจะแสดงผลผิดพลาด
// สรุปคือ int ใช้เก็บค่าตัวเลขจำนวนเต็มเเละจะปัดทศนิยมทิ้งไป ส่วน float จะใช้ในการเก็บค่าตัวเลขทศนิยมด้วย